
import os
from pathlib import Path
import shutil
import random

# Напишите функцию группового переименования файлов. Она должна:
# принимать параметр желаемое конечное имя файлов.
# При переименовании в конце имени добавляется порядковый номер.
# принимать параметр количество цифр в порядковом номере.
# принимать параметр расширение исходного файла.
# Переименование должно работать только для этих файлов внутри каталога.
# принимать параметр расширение конечного файла.
# принимать диапазон сохраняемого оригинального имени. Например для диапазона [3, 6] берутся буквы с 3 по 6 из исходного имени файла.
# К ним прибавляется желаемое конечное имя, если оно передано. Далее счётчик файлов и расширение.

my_file = 10

for i in range(my_file):
    with open(f'file_{i}', 'w', encoding='utf-8') as f:
        one_number = str(random.randint(-1000, 1000))
        two_number = str(random.random() * 1000)
        f.write(one_number)
        f.write('/')
        f.write(two_number)
for i in range(3, 6, 1):
    f = Path(f'file_{i}')
    f.rename(f'new_file_{i}')
