#Добавьте в модуль с загадками функцию, которая хранит словарь списков. 
#Ключ словаря - загадка, значение - список с отгадками. 
#Функция в цикле вызывает загадывающую функцию, чтобы передать ей все свои загадки. 

#Добавьте в модуль с загадками функцию, которая принимает на вход строку (текст загадки) и число (номер попытки, с которой она угадана). 
#Функция формирует словарь с информацией о результатах отгадывания. 
#Для хранения используйте защищённый словарь уровня модуля.
#Отдельно напишите функцию, которая выводит результаты угадывания из защищённого словаря в удобном для чтения виде. 
#Для формирования результатов используйте генераторное выражение.

import zagadka

def new_puzzle(puzless:dict):
    for key, value in puzless.items():
        task.puzzle in puzless.items()
  